/*
기능 요구사항

1부터 9까지 백의 자리 숫자 랜덤 생성
그 숫자를 제외한 1부터 9까지 십의 자리 숫자 랜덤 생성
위 두 숫자를 제외한 1부터 9까지 일의 자리 숫자 랜덤 생성

게임 시작 문구 출력
입력 받기
입력 받은 수가 서로 다른 3자리의 수 맞는지 확인
같은 수가 같은 자리에 있는지 확인 후 스트라이크 기록
다른 자리에 있는지 확인 후 볼 기록
둘 다 없을 경우 낫싱 표기, 하나의 경우 그것만 표기

throw 문으로 예외 발생 후 게임 종료 경우:
3자리 미만 또는 초과 시, 같은 수 2번 이상 반복 시, 숫자 외 입력 시
위 과정 반복, 3 숫자 모두 맞출 경우 게임 종료
종료 메세지 표기, 새로운 게임 시작 또는 종료 옵션
입력 받고 새 게임 시작 또는 종료
*/
/*
요구사항 자주 읽기
커밋 자주하고 메세지 잘 쓰기
함수 잘게 쪼개기
변수/메서드/클라스 네이밍 알기 쉽게
Loop은 최대 두개
Test Code는 최대한 자주 사용하기
*/

class App {
  play() {}
}

module.exports = App;
